pmo-dataset/mermaid/03.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	Task_6["Place stock on\nshelves"] --> ExclusiveGateway_6{"X"}
	ExclusiveGateway_3{"X"} --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_6 --> ParallelGateway_2{"+"}
	ExclusiveGateway_3 --> ExclusiveGateway_1{"X"}
	ExclusiveGateway_4 --> Task_8["Send a manual alert"]
	Task_10["Place stock in\nstorage"] --> ExclusiveGateway_6
	Task_7["Check current\ninventory level"] --> ExclusiveGateway_3
	ExclusiveGateway_4 --> Task_9["Send an automated\nalert"]
	Task_3["Inspect stock for\nquality"] --> ExclusiveGateway_2{"X"}
	Task_5["Receive stock"] --> ParallelGateway_1{"+"}
	Task_11["Record stock in\nsystem"] --> ParallelGateway_2
	Task_8 --> ExclusiveGateway_5{"X"}
	Task_2["Update inventory\nsystem with expected\ndelivery dates"] --> Task_5
	ParallelGateway_2 --> Task_1["Update inventory\nlevels"]
	ExclusiveGateway_2 --> Task_6
	ExclusiveGateway_2 --> Task_10
	Task_4["Place order with\nsuppliers"] --> Task_2
	StartNoneEvent_1(("start")) --> ExclusiveGateway_1
	Task_1 --> EndNoneEvent_1(("end")):::endEvent
	ParallelGateway_1 --> Task_11
	ExclusiveGateway_5 --> Task_4
	ParallelGateway_1 --> Task_3
	ExclusiveGateway_1 --> Task_7
	Task_9 --> ExclusiveGateway_5
